workout/app/controllers/excercises_controller.rb

SELECT  "excercises".* FROM "excercises" WHERE "excercises"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def edit
		@excercise = Excercise.find(params[:id])