workout/app/controllers/excercises_controller.rb

SELECT  "excercises".* FROM "excercises" WHERE "excercises"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "excercises".* FROM "excercises"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
	def show
		@excercise_new = Excercise.new
		@excercise = Excercise.find(params[:id])
		@excercises = Excercise.all
		@user = User.find(current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "excercises".* FROM "excercises"
---
	def index
		@excercise_new = Excercise.new
		@user = User.find(current_user.id)
		@event = Event.new
		@excercises = Excercise.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "excercises" ("target", "excercise_name", "reps", "sets", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["target", "Back"], ["excercise_name", "Pull Down"], ["reps", 10], ["sets", 3], ["created_at", "2020-02-25 06:34:41.092874"], ["updated_at", "2020-02-25 06:34:41.092874"], ["user_id", 4]]
---
	def create
		@user = User.find(current_user.id)
		@excercise_new = Excercise.new(excercise_params)
		@excercises = Excercise.all
		@excercise_new.user_id = current_user.id
		if @excercise_new.save

SELECT  "excercises".* FROM "excercises" WHERE "excercises"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "excercises" WHERE "excercises"."id" = ?  [["id", 1]]
---
	def destroy
		@excercise = Excercise.find(params[:id])
		@excercise.destroy