workout/app/controllers/users_controller.rb

	def show
		@user = User.find(params[:id])
		@excercise_new = Excercise.new
		@excercises = @user.excercises.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "excercises".* FROM "excercises" WHERE "excercises"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def index
		@user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def update
		@user = User.find(params[:id])
		if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "machine"], ["profile_image_id", nil], ["introduction", "machine"], ["updated_at", "2020-02-25 06:16:26.460562"], ["id", 3]]