debug_app/app/controllers/memos_controller.rb

SELECT "memos".* FROM "memos"
---
  def index
    @memos = Memo.all

INSERT INTO "memos" ("title", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "追加メモ"], ["comment", "追加コメント"], ["created_at", "2020-02-20 06:08:09.048357"], ["updated_at", "2020-02-20 06:08:09.048357"]]
---
  def create
    @memo = Memo.new(memo_params)
    respond_to do |format|
      if @memo.save

SELECT  "memos".* FROM "memos" WHERE "memos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_memo
      @memo = Memo.find(params[:id])