sample_app/app/controllers/todolists_controller.rb

INSERT INTO "lists" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "タイ"], ["body", "rails"], ["created_at", "2020-02-01 06:40:42.063202"], ["updated_at", "2020-02-01 06:40:42.063202"]]
---
  def create
  		list=List.new(list_params)
  		# bdへ保存する
  		list.save