meshiterro/app/views/post_images/show.html.erb

            <ol>
              <%= @post_image.post_comments.each do |post_comment| %>
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_image_id" = ?  [["post_image_id", 6]]