Bookers/app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
---
	def show
		@book_new = Book.new
		@book = Book.find(params[:id])
		@user = User.find(current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "books".* FROM "books"
---
	def index
		@user = User.find(current_user.id)
		@book_new = Book.new
		@books = Book.all

SELECT "books".* FROM "books"
INSERT INTO "books" ("created_at", "updated_at", "user_id", "title", "body") VALUES (?, ?, ?, ?, ?)  [["created_at", "2020-02-15 05:58:41.363214"], ["updated_at", "2020-02-15 05:58:41.363214"], ["user_id", 2], ["title", "確認"], ["body", "noticeの"]]
---
	def create
			book = Book.new(book_params)
			@books = Book.all
			book.user_id = current_user.id
			if book.save