Bookers/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "books" WHERE "books"."user_id" = ?  [["user_id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	def show
		@user = User.find(params[:id])
		@book_new = Book.new
		# @book = Book.find(params[:id])
		@books = @user.books.page(params[:page]).reverse_order  # ここを記述

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
	def index
		@user = User.find(current_user.id)
		@users = User.all